console.log(2 + "2" == "2" + 2);//выведет true, потому что тип number сладывается с типом string, получается  "22" == "22"
console.log(2 + "3" == "3" + 2); //выведет false, потому что число сладывается со строкой и 1вые операнды не равны, получается "23" == "32" 
console.log("3" + "2" == 3 + 2); //выведет false, потому что в 1ом вычислении конкатенируются строки, во 2ом вычислении суммируются  числа, получается "32" == 5
console.log("3" + "2" == "3" + 2); //выведет true, потому что в 1ом и во 2м вычислении конкатенирование строк и 1вые операнды вычисления равны, получается "32" == "32" 
console.log("3" + "2" == 2 + "3"); //выведет false, потому что в 1ом вычислении конкатенируются строки, во 2ом - число конкатенируется со строкой и 1вые операнды не равны, получается "32"== "23"
console.log(2 + Number("3") == Number("3") + 2); //выведет true, потому что строка преобразуется в числовой тип данных и операнды сумируются, получается 5 == 5 
console.log(12 / "6"); // выведет 2, потомучто оператор строку переобразовывает в числовой тип данных и числа делит между собой
console.log("number" + 15 + 3); // выведет "number153", потому что вычисление идет по порядку и преобразуется в строку: 1)"number" + 15 = "number15"; 2)"number15" + 3 = "number153"
console.log(15 + 3 + "number"); // выведет "18number", потому что оператор выполняется слева направо, 1) 15 + 3 = 18 - числовой тип данных; 2) 18 + "number" = "18number" - конкатенируются в строку
console.log([1] > null); // выведет true, потому что оператор сравнения вызывает численное преобразование,[1] - 1; null - это 0; 1 > 0 - это правда
console.log("foo" + +"bar"); // выведет fooNaN, потому что 1вый оператор слажывает операнды, а 2й оператор строку "bar" пытается превратить в число - на выходе получается NaN
console.log('true' == true); // выведет false, потому что оператор сравнения вызывает численное переобразование "true" = NaN, а true = 1; NaN = 1 - это ложь
console.log(false == 'false'); // выведет false, потому что оператор сравнения вызывает численное переобразование. "false" = NaN, а false = 0
console.log(null == ''); // выведет false, потому что оператор сравнения не переобразовывает null в числовой тип данных, null = только null и undefined
console.log(!!"false" == !!"true"); // выведет true, потому что оператор !! конвертирует строки true и false в булевое значение true, так как это не пустые строки 
console.log(['x'] == 'x'); // выведет true, значения операндов одинаковы. 

const enemy = {
    name: "Bob"
};

const friend = {
    name: "Alex"
};

const me = friend;
me.name = "Bob";

console.log(friend.name); // выведет "Bob", потому что me ccылается на объект, а не делает его копию
console.log(me === friend); // выведет true, потому что это один и тот же объект, так как me ccылается на объект, а не делает его копию
console.log(me === enemy); // выведет false, потому что это 2 разных объекта

